export interface CityStateData {
  state: string;
  cities: string[];
}

export const STATES: CityStateData[] = [
  {
    state: 'الخرطوم',
    cities: [
      'الخرطوم',
      'أم درمان',
      'الخرطوم بحري',
      'العيلفون',
      'الجيلي',
      'جبل أولياء',
    ],
  },
  {
    state: 'الجزيرة',
    cities: [
      'ود مدني',
      'الحصاحيصا',
      'الكاملين',
      'المناقل',
      'رفاعة',
      'طابت',
      'الحاج عبد الله',
    ],
  },
  {
    state: 'البحر الأحمر',
    cities: [
      'بورتسودان',
      'سواكن',
      'طوكر',
      'جبيت',
      'هيا',
      'درديب',
      'محمد قول',
    ],
  },
  {
    state: 'القضارف',
    cities: [
      'القضارف',
      'الفاو',
      'الدوكة',
      'الحواتة',
      'المفازة',
      'قلع النحل',
      'الشواك',
    ],
  },
  {
    state: 'كسلا',
    cities: [
      'كسلا',
      'حلفا الجديدة',
      'خشم القربة',
      'أروما',
      'وقر',
      'همشكوريب',
    ],
  },
  {
    state: 'سنار',
    cities: [
      'سنجة',
      'سنار',
      'الدندر',
      'السوكي',
      'أبو حجار',
      'مايرنو',
    ],
  },
  {
    state: 'نهر النيل',
    cities: [
      'الدامر',
      'عطبرة',
      'شندي',
      'المتمة',
      'بربر',
      'أبو حمد',
    ],
  },
  {
    state: 'الولاية الشمالية',
    cities: [
      'دنقلا',
      'وادي حلفا',
      'مروي',
      'الدبة',
      'كرمة',
      'عبري',
      'البرقيق',
    ],
  },
  {
    state: 'النيل الأبيض',
    cities: [
      'ربك',
      'كوستي',
      'الدويم',
      'القطينة',
      'تندلتي',
      'الجزيرة أبا',
      'الكنانة',
    ],
  },
  {
    state: 'النيل الأزرق',
    cities: [
      'الدمازين',
      'الروصيرص',
      'باو',
      'قيسان',
      'الكرمك',
      'ود الماحي',
    ],
  },
  {
    state: 'شمال كردفان',
    cities: [
      'الأبيض',
      'النهود',
      'بارا',
      'أم روابة',
      'الرهد',
      'ود بندة',
    ],
  },
  {
    state: 'جنوب كردفان',
    cities: [
      'كادوقلي',
      'الدلنج',
      'أبو جبيهة',
      'تلودي',
      'رشاد',
      'لقاوة',
    ],
  },
  {
    state: 'غرب كردفان',
    cities: [
      'الفولة',
      'بابنوسة',
      'المجلد',
      'غبيش',
      'الأضية',
    ],
  },
  {
    state: 'شمال دارفور',
    cities: [
      'الفاشر',
      'كتم',
      'مليط',
      'كبكابية',
      'أم كدادة',
      'كورما',
    ],
  },
  {
    state: 'جنوب دارفور',
    cities: [
      'نيالا',
      'كاس',
      'عد الفرسان',
      'برام',
      'تلس',
    ],
  },
  {
    state: 'غرب دارفور',
    cities: [
      'الجنينة',
      'كلبس',
      'كرينك',
      'فوربرنقا',
      'هبيلا',
    ],
  },
  {
    state: 'شرق دارفور',
    cities: [
      'الضعين',
      'عسلاية',
      'أبو كارنكا',
      'عديلة',
      'أبو جابرة',
    ],
  },
  {
    state: 'وسط دارفور',
    cities: [
      'زالنجي',
      'بندسي',
      'نيرتتي',
      'مكجر',
      'وادي صالح',
    ],
  },
];
